---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthsDisplayOption
source: html/9297e2e5-0c49-73c0-abea-73f008dc52aa.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthsDisplayOption Property

Identifies if the segment lengths are represented using dimensions or just as text.

## Syntax (C#)
```csharp
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration